{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "arch_00", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 20, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "main_input"}, "name": "main_input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_1", "inbound_nodes": [[["main_input", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu", "inbound_nodes": [[["conv_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "Max_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "Max_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["Max_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_1", "inbound_nodes": [[["conv_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "Max_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "Max_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["Max_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_2", "inbound_nodes": [[["conv_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "Max_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "Max_3", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["Max_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "2d_matrix", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "2d_matrix", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["2d_matrix", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_3", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_4", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_5", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "main_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "main_output", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}], "input_layers": [["main_input", 0, 0]], "output_layers": [["main_output", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0005000000237487257, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4628673791885376, "scale": 0.0025542287265553193, "original_dtype": "float32"}}, {"name": "batch_normalization/beta", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.4574683904647827, "scale": 0.004693407170912799, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18520244920954984, "scale": 0.0034296749853620343, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.013447043485939503, "scale": 0.0007883661043118028, "original_dtype": "float32"}}, {"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4668067991733551, "scale": 0.0027262892208847343, "original_dtype": "float32"}}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.2343053817749023, "scale": 0.007611833483565087, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -4.141850813697366, "scale": 0.05833592695348403, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 5.396465301513672, "scale": 0.23275904935948988, "original_dtype": "float32"}}, {"name": "batch_normalization_2/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.3365110754966736, "scale": 0.003793826991436528, "original_dtype": "float32"}}, {"name": "batch_normalization_2/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.6361396463916582, "scale": 0.0066240471513832316, "original_dtype": "float32"}}, {"name": "batch_normalization_2/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -11.243361368366317, "scale": 0.11132040958778532, "original_dtype": "float32"}}, {"name": "batch_normalization_2/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 11.15289306640625, "scale": 0.5149569043926164, "original_dtype": "float32"}}, {"name": "batch_normalization_3/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.3895484209060669, "scale": 0.004830562834646187, "original_dtype": "float32"}}, {"name": "batch_normalization_3/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7792049576254452, "scale": 0.00649337464687871, "original_dtype": "float32"}}, {"name": "batch_normalization_3/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -17.84662523456648, "scale": 0.22308281543208103, "original_dtype": "float32"}}, {"name": "batch_normalization_3/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 31.463886260986328, "scale": 7.263224687763289, "original_dtype": "float32"}}, {"name": "batch_normalization_4/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.3311145603656769, "scale": 0.003554276274699791, "original_dtype": "float32"}}, {"name": "batch_normalization_4/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.691501048265719, "scale": 0.005444890143824559, "original_dtype": "float32"}}, {"name": "batch_normalization_4/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -7.054341409720627, "scale": 0.07198307560939415, "original_dtype": "float32"}}, {"name": "batch_normalization_4/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 13.685201644897461, "scale": 0.9112005869547526, "original_dtype": "float32"}}, {"name": "batch_normalization_5/gamma", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6645396947860718, "scale": 0.001522058599135455, "original_dtype": "float32"}}, {"name": "batch_normalization_5/beta", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16940673326744754, "scale": 0.0009010996450396145, "original_dtype": "float32"}}, {"name": "batch_normalization_5/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.6262487112307085, "scale": 0.017988004871443208, "original_dtype": "float32"}}, {"name": "batch_normalization_5/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 10.393389701843262, "scale": 0.09431239483403224, "original_dtype": "float32"}}, {"name": "conv_1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.1818877463247262, "scale": 0.008264949274998086, "original_dtype": "float32"}}, {"name": "conv_1/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8248565196990967, "scale": 0.004582536220550537, "original_dtype": "float32"}}, {"name": "conv_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.4778416970196893, "scale": 0.01492769390928979, "original_dtype": "float32"}}, {"name": "conv_2/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.8258750630067846, "scale": 0.011440789728772407, "original_dtype": "float32"}}, {"name": "conv_3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.9120856070051007, "scale": 0.015672832844304103, "original_dtype": "float32"}}, {"name": "conv_3/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.5317686099632113, "scale": 0.009227521746766333, "original_dtype": "float32"}}, {"name": "dense/kernel", "shape": [1536, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.4485683665556066, "scale": 0.011316940363715677, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8418526897243425, "scale": 0.009251128458509257, "original_dtype": "float32"}}, {"name": "dense_1/kernel", "shape": [128, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.2239530563354493, "scale": 0.00899965482599595, "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.8103632506202247, "scale": 0.018249112017014447, "original_dtype": "float32"}}, {"name": "dense_2/kernel", "shape": [64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0905346954570099, "scale": 0.008138318622813506, "original_dtype": "float32"}}, {"name": "dense_2/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.340070917559605, "scale": 0.01381516409855263, "original_dtype": "float32"}}, {"name": "main_output/kernel", "shape": [32, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1697979211807251, "scale": 0.001248514126328861, "original_dtype": "float32"}}, {"name": "main_output/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.036335546523332596, "scale": 1.0, "original_dtype": "float32"}}]}]}